# Реализовать проект «Операции с комплексными числами». Создайте класс «Комплексное число».
# Реализуйте перегрузку методов сложения и умножения комплексных чисел. Проверьте работу проекта.
# Для этого создаёте экземпляры класса (комплексные числа), выполните сложение и умножение созданных экземпляров.
# Проверьте корректность полученного результата.

class ComplexNumber:

    def __init__(self, number):
        self.number = number

    def __add__(self, other):
        return self.number + other.number

    def __mul__(self, other):
        return self.number * other.number


number_1 = ComplexNumber(int(input("Введите число: ")))
number_2 = ComplexNumber(int(input("Введите число: ")))
print(ComplexNumber.__add__(number_1, number_2))
print(ComplexNumber.__mul__(number_1, number_2))
